---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\wd\adultery-law-south-korea-demres\log/01_data-prep.log
  log type:  text
 opened on:  27 Nov 2024, 18:43:03

. 
. ******************************************************************************
. *** Process Waves 1 to W4
. *****************************************************************************
. tempfile w1 w2 w3 w4 

. 
. 
. *** W1 *************************************************************************
. use data/klowf01p.dta, clear

. 
. do code/remove-labels.do // (comment out if you want the variable/value labels)

. * Drop all value labels and variable labels (comment out if you want the labels)
. * Remove all value labels
. _strip_labels *

. 
. * Remove all variable labels
. foreach var of varlist _all {
  2.     label variable `var' ""
  3. }

. 
end of do-file

. 
. * keep only the initally sampled respondents 
. keep if roundf == 1
(0 observations deleted)

. 
. * indicator variables for survey waves
. gen W = 1

. gen w1 = 1

. 
. * recode missing outcome
. recode P127AM04 -9=., gen(y)
(18 differences between P127AM04 and y)

. clonevar y1 = y
(18 missing values generated)

. 
. *** recode background variables
. egen age_1 = cut(P199AG), at(0 40 50 70) // age

. tab age_1 P199AG, m 

           |                                                                                                P199AG
     age_1 |        18         19         20         21         22         23         24         25         26         27         28         29         30         31         32         33         34         35 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         2        111        111        106         97        103        135        136        143        177        215        208        214        249        312        316        321        331 |     4,650 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,489 
        50 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,858 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |         2        111        111        106         97        103        135        136        143        177        215        208        214        249        312        316        321        331 |     9,997 


           |                                                                                                P199AG
     age_1 |        36         37         38         39         40         41         42         43         44         45         46         47         48         49         50         51         52         53 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |       372        375        297        319          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     4,650 
        40 |         0          0          0          0        300        247        257        277        259        239        214        250        228        218          0          0          0          0 |     2,489 
        50 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0        234        182        230        232 |     2,858 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       372        375        297        319        300        247        257        277        259        239        214        250        228        218        234        182        230        232 |     9,997 


           |                                                                     P199AG
     age_1 |        54         55         56         57         58         59         60         61         62         63         64         65         67 |     Total
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          0          0          0          0          0          0          0          0 |     4,650 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,489 
        50 |       174        225        151        186        165        202        224        171        167        171        142          1          1 |     2,858 
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       174        225        151        186        165        202        224        171        167        171        142          1          1 |     9,997 

. recode PP102ED01 -8 = . -9=. 1/4 = 1 5/8 = 2 , gen(educ_1) // education
(9,663 differences between PP102ED01 and educ_1)

. gen marital_1 = (P104ML01 == 1) if !missing(P104ML01) // marital status

. clonevar marital_d_1 = PP107ML02 // marital status - detailed

. replace marital_d_1 = . if marital_d_1 < 0
(2 real changes made, 2 to missing)

. gen employed_1 = (WW101EA02 == 1 ) if !missing(WW101EA02) // employment status
(2 missing values generated)

. recode P128RG01 .=0 1=0 2=3 3=3 4=1 5=2   6=0 -8 = . -9 = ., gen(relig_1) // religion
(9,961 differences between P128RG01 and relig_1)

. tab P128RG01 relig_1, m

           |                   RECODE of P128RG01
  P128RG01 |         0          1          2          3          . |     Total
-----------+-------------------------------------------------------+----------
        -9 |         0          0          0          0         41 |        41 
        -8 |         0          0          0          0          1 |         1 
         1 |        57          0          0          0          0 |        57 
         2 |         0          0          0      2,382          0 |     2,382 
         3 |         0          0          0         36          0 |        36 
         4 |         0      2,221          0          0          0 |     2,221 
         5 |         0          0        751          0          0 |       751 
         6 |        57          0          0          0          0 |        57 
         . |     4,451          0          0          0          0 |     4,451 
-----------+-------------------------------------------------------+----------
     Total |     4,565      2,221        751      2,418         42 |     9,997 

. recode P1011505  -8 = . -9=. 1/4 = 1 5/8 = 2  , gen(educ_f_1) // parent education
(7,821 differences between P1011505 and educ_f_1)

. recode P1011506 -8 = . -9=. 1/4 = 1 5/8 = 2   , gen(educ_m_1)
(7,419 differences between P1011506 and educ_m_1)

. recode PP101SN03 -8 = . -9=., gen(sibnum_1) // number of siblings
(24 differences between PP101SN03 and sibnum_1)

. recode P115PG01 1=1 2=0, gen(cbirth_1) // fertility experience
(1,613 differences between P115PG01 and cbirth_1)

. recode P1011501 -9 = 3 4=1, gen(reg15_1) //
(35 differences between P1011501 and reg15_1)

. 
. * save as a tempfile
. save `w1', replace
(file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000001.tmp not found)
file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000001.tmp saved as .dta format

. 
. 
. *** W2 *************************************************************************
. use data/klowf02p.dta, clear

. 
. do code/remove-labels.do // (comment out if you want the variable/value labels)

. * Drop all value labels and variable labels (comment out if you want the labels)
. * Remove all value labels
. _strip_labels *

. 
. * Remove all variable labels
. foreach var of varlist _all {
  2.     label variable `var' ""
  3. }

. 
end of do-file

. 
. 
. * keep only the inital sampled respondents
. keep if  roundf == 1
(0 observations deleted)

. keep if P299ONE == 1
(0 observations deleted)

. 
. * indicator variables for survey waves
. gen W = 2

. gen w2= 1

. 
. * recode missing outcome
. recode P227AM04 -9=., gen(y)
(1 differences between P227AM04 and y)

. clonevar y2 = y
(1 missing value generated)

. 
. *** recode background variables
. egen age_2 = cut(P299AG), at(0 40 50 70) // age

. tab age_2 P299AG, m 

           |                                                                                                P299AG
     age_2 |        19         20         21         22         23         24         25         26         27         28         29         30         31         32         33         34         35         36 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         2         79         64         75         72         81         99        103        100        147        171        163        170        217        274        254        273        291 |     3,510 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,158 
        50 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,696 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |         2         79         64         75         72         81         99        103        100        147        171        163        170        217        274        254        273        291 |     8,364 


           |                                                                                                P299AG
     age_2 |        37         38         39         40         41         42         43         44         45         46         47         48         49         50         51         52         53         54 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |       314        312        249          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     3,510 
        40 |         0          0          0        269        252        202        218        229        216        195        183        203        191          0          0          0          0          0 |     2,158 
        50 |         0          0          0          0          0          0          0          0          0          0          0          0          0        193        185        162        206        202 |     2,696 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       314        312        249        269        252        202        218        229        216        195        183        203        191        193        185        162        206        202 |     8,364 


           |                                                               P299AG
     age_2 |        55         56         57         58         59         60         61         62         63         64         65         66 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          0          0          0          0          0          0          0 |     3,510 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0 |     2,158 
        50 |       151        196        129        167        143        187        201        148        150        149        126          1 |     2,696 
-----------+------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       151        196        129        167        143        187        201        148        150        149        126          1 |     8,364 

. recode PP202ED01 -8 = . -9=. 1/4 = 1 5/8 = 2 , gen(educ_2) // education
(8,068 differences between PP202ED01 and educ_2)

. gen marital_2 = (P204ML01 == 1) if !missing(P204ML01) // marital status

. clonevar marital_d_2 = PP207ML02 // marital status - detailed

. gen employed_2 = (WW201EA02 == 1 ) if !missing(WW201EA02) // employment status

. recode P228RG01 .=0 1=0 2=3 3=3 4=1 5=2   6=0 -8 = . -9 = ., gen(relig_2) // religion
(8,329 differences between P228RG01 and relig_2)

. tab P228RG01 relig_2, m

           |                   RECODE of P228RG01
  P228RG01 |         0          1          2          3          . |     Total
-----------+-------------------------------------------------------+----------
        -9 |         0          0          0          0          1 |         1 
         1 |        33          0          0          0          0 |        33 
         2 |         0          0          0      2,056          0 |     2,056 
         3 |         0          0          0         35          0 |        35 
         4 |         0      1,852          0          0          0 |     1,852 
         5 |         0          0        593          0          0 |       593 
         6 |        52          0          0          0          0 |        52 
         . |     3,742          0          0          0          0 |     3,742 
-----------+-------------------------------------------------------+----------
     Total |     3,827      1,852        593      2,091          1 |     8,364 

. recode PP201SN03 -8 = . -9=., gen(sibnum_2) // number of siblings
(24 differences between PP201SN03 and sibnum_2)

. recode P215PG01 1=1 2=0, gen(cbirth_2) // fertility experience
(8,035 differences between P215PG01 and cbirth_2)

. 
. * save as a tempfile
. save `w2', replace
(file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000002.tmp not found)
file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000002.tmp saved as .dta format

. 
. *** W3 *************************************************************************
. use data/klowf03p.dta, clear

. 
. do code/remove-labels.do // (comment out if you want the variable/value labels)

. * Drop all value labels and variable labels (comment out if you want the labels)
. * Remove all value labels
. _strip_labels *

. 
. * Remove all variable labels
. foreach var of varlist _all {
  2.     label variable `var' ""
  3. }

. 
end of do-file

. 
. 
. * keep only the inital sampled respondents
. keep if  roundf == 1
(25 observations deleted)

. keep if P399ONE == 1
(92 observations deleted)

. 
. * indicator variables for survey waves
. gen W = 3

. gen w3= 1

. 
. * recode missing outcome
. recode P327FV14 -9=. , gen(y)
(2 differences between P327FV14 and y)

. clonevar y3 = y
(2 missing values generated)

. 
. *** recode background variables
. egen age_3 = cut(P399AG), at(0 40 50 70) // age

. tab age_3 P399AG, m 

           |                                                                                                P399AG
     age_3 |        21         22         23         24         25         26         27         28         29         30         31         32         33         34         35         36         37         38 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         1         74         62         68         57         72         88         88         97        131        144        148        156        193        253        239        247        270 |     2,671 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,180 
        50 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     3,033 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |         1         74         62         68         57         72         88         88         97        131        144        148        156        193        253        239        247        270 |     7,884 


           |                                                                                                P399AG
     age_3 |        39         40         41         42         43         44         45         46         47         48         49         50         51         52         53         54         55         56 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |       283          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,671 
        40 |         0        287        235        256        229        180        210        216        202        195        170          0          0          0          0          0          0          0 |     2,180 
        50 |         0          0          0          0          0          0          0          0          0          0          0        204        188        181        181        152        193        196 |     3,033 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       283        287        235        256        229        180        210        216        202        195        170        204        188        181        181        152        193        196 |     7,884 


           |                                                               P399AG
     age_3 |        57         58         59         60         61         62         63         64         65         66         67         68 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          0          0          0          0          0          0          0 |     2,671 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0 |     2,180 
        50 |       151        202        131        163        143        180        195        149        148        148        127          1 |     3,033 
-----------+------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       151        202        131        163        143        180        195        149        148        148        127          1 |     7,884 

. recode PP302ED01 -8 = . -9=. 1/4 = 1 5/8 = 2 , gen(educ_3) // education
(7,588 differences between PP302ED01 and educ_3)

. gen marital_3 = (P304ML01 == 1) if !missing(P304ML01) // marital status

. clonevar marital_d_3 = PP307ML02B // marital status - detailed

. gen employed_3 = (WW301EA02 == 1 ) if !missing(WW301EA02) // employment status

. recode P328RG01 1=0 2=3 3=3 4=1 5=2   6=0 7= 0 -8 = . -9 = ., gen(relig_3) // religion
(7,858 differences between P328RG01 and relig_3)

. tab P328RG01 relig_3, m

           |                   RECODE of P328RG01
  P328RG01 |         0          1          2          3          . |     Total
-----------+-------------------------------------------------------+----------
        -9 |         0          0          0          0          1 |         1 
        -8 |         0          0          0          0          2 |         2 
         1 |         8          0          0          0          0 |         8 
         2 |         0          0          0      2,107          0 |     2,107 
         3 |         0          0          0         26          0 |        26 
         4 |         0      1,689          0          0          0 |     1,689 
         5 |         0          0        568          0          0 |       568 
         6 |     3,449          0          0          0          0 |     3,449 
         7 |        34          0          0          0          0 |        34 
-----------+-------------------------------------------------------+----------
     Total |     3,491      1,689        568      2,133          3 |     7,884 

. recode P324SN03 -8 = . -9=., gen(sibnum_3) // number of siblings
(3 differences between P324SN03 and sibnum_3)

. recode P315PG01 1=1 2=0, gen(cbirth_3) // fertility experience
(7,580 differences between P315PG01 and cbirth_3)

. 
. * save as a tempfile
. save `w3', replace
(file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000003.tmp not found)
file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000003.tmp saved as .dta format

. 
. 
. *** W4 *************************************************************************
. use data/klowf04p.dta, clear

. 
. do code/remove-labels.do // (comment out if you want the variable/value labels)

. * Drop all value labels and variable labels (comment out if you want the labels)
. * Remove all value labels
. _strip_labels *

. 
. * Remove all variable labels
. foreach var of varlist _all {
  2.     label variable `var' ""
  3. }

. 
end of do-file

. 
. * keep only the inital sampled respondents
. keep if  roundf == 1
(55 observations deleted)

. keep if P499ONE == 1
(292 observations deleted)

. 
. * indicator variables for survey waves
. gen W = 4

. gen w4= 1

. 
. * recode missing outcome
. recode P427FV14 -8=. -9=. , gen(y)
(1 differences between P427FV14 and y)

. clonevar y4 = y
(1 missing value generated)

. 
. *** recode background variables
. egen age_4 = cut(P499AG), at(0 40 50 70) // age
(2 missing values generated)

. tab age_4 P499AG, m 

           |                                                                                                P499AG
     age_4 |        23         24         25         26         27         28         29         30         31         32         33         34         35         36         37         38         39         40 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         1         68         56         55         50         58         76         77         73        111        127        135        137        176        233        230        226          0 |     1,889 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0        240 |     2,198 
        50 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     3,228 
         . |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |         2 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |         1         68         56         55         50         58         76         77         73        111        127        135        137        176        233        230        226        240 |     7,317 


           |                                                                                                P499AG
     age_4 |        41         42         43         44         45         46         47         48         49         50         51         52         53         54         55         56         57         58 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     1,889 
        40 |       266        271        220        225        222        168        191        209        186          0          0          0          0          0          0          0          0          0 |     2,198 
        50 |         0          0          0          0          0          0          0          0          0        178        154        184        180        172        175        144        185        187 |     3,228 
         . |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |         2 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       266        271        220        225        222        168        191        209        186        178        154        184        180        172        175        144        185        187 |     7,317 


           |                                                                     P499AG
     age_4 |        59         60         61         62         63         64         65         66         67         68         69         70         72 |     Total
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          0          0          0          0          0          0          0          0          0          0          0          0 |     1,889 
        40 |         0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,198 
        50 |       143        194        125        154        139        171        193        143        146        143        118          0          0 |     3,228 
         . |         0          0          0          0          0          0          0          0          0          0          0          1          1 |         2 
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       143        194        125        154        139        171        193        143        146        143        118          1          1 |     7,317 

. recode PP402ED01 -8 = . -9=. 1/4 = 1 5/8 = 2 , gen(educ_4) // education
(7,029 differences between PP402ED01 and educ_4)

. recode PP407ML02B 1=0 2/5=1, gen(marital_4) // marital status
(7,317 differences between PP407ML02B and marital_4)

. clonevar marital_d_4 = PP407ML02B // marital status - detailed

. gen employed_4 = ( WW401EA02 == 1 ) if !missing( WW401EA02) // employment status

. recode P428RG01 1=0 2=3 3=3 4=1 5=2   6=0 7= 0 -8 = . -9 = ., gen(relig_4) // religion
(7,292 differences between P428RG01 and relig_4)

. tab P428RG01 relig_4, m

           |                   RECODE of P428RG01
  P428RG01 |         0          1          2          3          . |     Total
-----------+-------------------------------------------------------+----------
        -8 |         0          0          0          0          1 |         1 
         1 |        20          0          0          0          0 |        20 
         2 |         0          0          0      2,031          0 |     2,031 
         3 |         0          0          0         25          0 |        25 
         4 |         0      1,603          0          0          0 |     1,603 
         5 |         0          0        543          0          0 |       543 
         6 |     3,054          0          0          0          0 |     3,054 
         7 |        40          0          0          0          0 |        40 
-----------+-------------------------------------------------------+----------
     Total |     3,114      1,603        543      2,056          1 |     7,317 

. recode P424SN03 -8 = . -9=., gen(sibnum_4) // number of siblings
(2 differences between P424SN03 and sibnum_4)

. recode P415PG01 1=1 2=0, gen(cbirth_4) // fertility experience
(7,081 differences between P415PG01 and cbirth_4)

. gen health_4 = 6- P428HE03

. 
. * save as a tempfile
. save `w4', replace
(file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000004.tmp not found)
file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000004.tmp saved as .dta format

. 
. 
. *** W5 *************************************************************************
. use data/klowf05p.dta, clear

. 
. do code/remove-labels.do // (comment out if you want the variable/value labels)

. * Drop all value labels and variable labels (comment out if you want the labels)
. * Remove all value labels
. _strip_labels *

. 
. * Remove all variable labels
. foreach var of varlist _all {
  2.     label variable `var' ""
  3. }

. 
end of do-file

. 
. * keep only the inital sampled respondents
. keep if  roundf == 1
(61 observations deleted)

. keep if P599ONE == 1
(368 observations deleted)

. 
. 
. * indicator variables for survey waves
. gen W = 5

. gen w5 = 1

. 
. * recode missing outcome
. recode P527FV14 -9=.,gen(y)
(1 differences between P527FV14 and y)

. clonevar y5 = y
(1 missing value generated)

. 
. *** convert interview dates into days since Jan 1 
. tab P05D_DAY, m

   P05D_DAY |      Freq.     Percent        Cum.
------------+-----------------------------------
 2014-06-30 |          5        0.07        0.07
 2014-07-01 |          4        0.06        0.13
 2014-07-02 |          2        0.03        0.16
 2014-07-03 |          7        0.10        0.26
 2014-07-04 |         12        0.17        0.43
 2014-07-05 |         10        0.14        0.57
 2014-07-06 |         10        0.14        0.71
 2014-07-07 |         12        0.17        0.88
 2014-07-08 |         13        0.18        1.07
 2014-07-09 |          6        0.09        1.15
 2014-07-10 |         18        0.26        1.41
 2014-07-11 |         22        0.31        1.72
 2014-07-12 |         23        0.33        2.05
 2014-07-13 |         11        0.16        2.20
 2014-07-14 |         16        0.23        2.43
 2014-07-15 |         24        0.34        2.77
 2014-07-16 |         33        0.47        3.24
 2014-07-17 |         44        0.63        3.87
 2014-07-18 |         15        0.21        4.08
 2014-07-19 |         13        0.18        4.26
 2014-07-20 |         16        0.23        4.49
 2014-07-21 |         11        0.16        4.65
 2014-07-22 |         15        0.21        4.86
 2014-07-23 |         13        0.18        5.04
 2014-07-24 |          3        0.04        5.09
 2014-07-25 |          5        0.07        5.16
 2014-07-26 |         24        0.34        5.50
 2014-07-27 |         24        0.34        5.84
 2014-07-28 |         18        0.26        6.10
 2014-07-29 |          3        0.04        6.14
 2014-07-30 |         10        0.14        6.28
 2014-07-31 |         10        0.14        6.42
 2014-08-01 |         10        0.14        6.57
 2014-08-02 |          5        0.07        6.64
 2014-08-03 |          9        0.13        6.76
 2014-08-04 |          6        0.09        6.85
 2014-08-05 |          9        0.13        6.98
 2014-08-06 |          8        0.11        7.09
 2014-08-07 |         10        0.14        7.23
 2014-08-08 |         20        0.28        7.52
 2014-08-09 |         15        0.21        7.73
 2014-08-10 |          4        0.06        7.79
 2014-08-11 |         10        0.14        7.93
 2014-08-12 |          2        0.03        7.96
 2014-08-13 |         13        0.18        8.14
 2014-08-14 |         18        0.26        8.40
 2014-08-15 |          6        0.09        8.48
 2014-08-16 |          6        0.09        8.57
 2014-08-18 |          3        0.04        8.61
 2014-08-19 |          9        0.13        8.74
 2014-08-20 |         22        0.31        9.05
 2014-08-21 |          9        0.13        9.18
 2014-08-22 |          3        0.04        9.22
 2014-08-23 |          6        0.09        9.31
 2014-08-24 |         30        0.43        9.73
 2014-08-25 |         10        0.14        9.88
 2014-08-26 |         18        0.26       10.13
 2014-08-27 |         14        0.20       10.33
 2014-08-28 |         25        0.36       10.69
 2014-08-29 |         16        0.23       10.91
 2014-08-30 |         13        0.18       11.10
 2014-08-31 |         28        0.40       11.50
 2014-09-01 |         25        0.36       11.85
 2014-09-02 |          8        0.11       11.97
 2014-09-03 |         12        0.17       12.14
 2014-09-04 |         17        0.24       12.38
 2014-09-05 |         12        0.17       12.55
 2014-09-06 |          5        0.07       12.62
 2014-09-07 |          1        0.01       12.63
 2014-09-08 |          2        0.03       12.66
 2014-09-09 |          4        0.06       12.72
 2014-09-10 |          1        0.01       12.73
 2014-09-11 |         23        0.33       13.06
 2014-09-12 |         11        0.16       13.22
 2014-09-13 |          8        0.11       13.33
 2014-09-14 |         32        0.45       13.78
 2014-09-15 |          8        0.11       13.90
 2014-09-16 |          6        0.09       13.98
 2014-09-17 |          2        0.03       14.01
 2014-09-18 |         12        0.17       14.18
 2014-09-19 |         14        0.20       14.38
 2014-09-20 |         15        0.21       14.59
 2014-09-21 |         17        0.24       14.84
 2014-09-22 |         17        0.24       15.08
 2014-09-23 |         17        0.24       15.32
 2014-09-24 |         29        0.41       15.73
 2014-09-25 |         22        0.31       16.04
 2014-09-26 |         46        0.65       16.70
 2014-09-27 |         54        0.77       17.46
 2014-09-28 |         65        0.92       18.39
 2014-09-29 |         35        0.50       18.89
 2014-09-30 |         20        0.28       19.17
 2014-10-01 |         45        0.64       19.81
 2014-10-02 |         71        1.01       20.82
 2014-10-03 |         61        0.87       21.69
 2014-10-04 |         78        1.11       22.79
 2014-10-05 |         79        1.12       23.92
 2014-10-06 |         54        0.77       24.68
 2014-10-07 |         56        0.80       25.48
 2014-10-08 |         45        0.64       26.12
 2014-10-09 |         47        0.67       26.79
 2014-10-10 |         69        0.98       27.77
 2014-10-11 |         79        1.12       28.89
 2014-10-12 |         99        1.41       30.30
 2014-10-13 |         60        0.85       31.15
 2014-10-14 |         50        0.71       31.86
 2014-10-15 |         32        0.45       32.31
 2014-10-16 |         39        0.55       32.87
 2014-10-17 |         54        0.77       33.64
 2014-10-18 |         67        0.95       34.59
 2014-10-19 |         76        1.08       35.67
 2014-10-20 |         63        0.90       36.56
 2014-10-21 |         31        0.44       37.00
 2014-10-22 |         45        0.64       37.64
 2014-10-23 |         41        0.58       38.23
 2014-10-24 |         54        0.77       38.99
 2014-10-25 |         75        1.07       40.06
 2014-10-26 |         86        1.22       41.28
 2014-10-27 |         52        0.74       42.02
 2014-10-28 |         41        0.58       42.60
 2014-10-29 |         30        0.43       43.03
 2014-10-30 |         48        0.68       43.71
 2014-10-31 |         40        0.57       44.28
 2014-11-01 |         21        0.30       44.58
 2014-11-02 |         52        0.74       45.32
 2014-11-03 |         41        0.58       45.90
 2014-11-04 |         21        0.30       46.20
 2014-11-05 |         35        0.50       46.70
 2014-11-06 |         15        0.21       46.91
 2014-11-07 |         31        0.44       47.35
 2014-11-08 |         41        0.58       47.93
 2014-11-09 |         71        1.01       48.94
 2014-11-10 |         45        0.64       49.58
 2014-11-11 |         17        0.24       49.82
 2014-11-12 |         17        0.24       50.06
 2014-11-13 |         20        0.28       50.35
 2014-11-14 |         17        0.24       50.59
 2014-11-15 |         55        0.78       51.37
 2014-11-16 |         62        0.88       52.25
 2014-11-17 |         51        0.72       52.98
 2014-11-18 |         31        0.44       53.42
 2014-11-19 |         28        0.40       53.82
 2014-11-20 |         42        0.60       54.41
 2014-11-21 |         33        0.47       54.88
 2014-11-22 |         29        0.41       55.29
 2014-11-23 |         33        0.47       55.76
 2014-11-24 |         31        0.44       56.20
 2014-11-25 |         25        0.36       56.56
 2014-11-26 |         25        0.36       56.91
 2014-11-27 |         36        0.51       57.43
 2014-11-28 |         20        0.28       57.71
 2014-11-29 |         45        0.64       58.35
 2014-11-30 |         54        0.77       59.12
 2014-12-01 |         42        0.60       59.71
 2014-12-02 |         19        0.27       59.98
 2014-12-03 |         32        0.45       60.44
 2014-12-04 |         32        0.45       60.89
 2014-12-05 |         30        0.43       61.32
 2014-12-06 |         44        0.63       61.94
 2014-12-07 |         69        0.98       62.92
 2014-12-08 |         36        0.51       63.44
 2014-12-09 |         22        0.31       63.75
 2014-12-10 |         21        0.30       64.05
 2014-12-11 |         44        0.63       64.67
 2014-12-12 |         38        0.54       65.21
 2014-12-13 |         54        0.77       65.98
 2014-12-14 |         62        0.88       66.86
 2014-12-15 |         34        0.48       67.34
 2014-12-16 |         29        0.41       67.76
 2014-12-17 |         30        0.43       68.18
 2014-12-18 |         41        0.58       68.77
 2014-12-19 |         32        0.45       69.22
 2014-12-20 |         34        0.48       69.70
 2014-12-21 |         79        1.12       70.83
 2014-12-22 |         64        0.91       71.74
 2014-12-23 |         82        1.17       72.90
 2014-12-24 |         46        0.65       73.55
 2014-12-25 |         37        0.53       74.08
 2014-12-26 |         23        0.33       74.41
 2014-12-27 |         43        0.61       75.02
 2014-12-28 |         71        1.01       76.03
 2014-12-29 |         38        0.54       76.57
 2014-12-30 |         30        0.43       76.99
 2014-12-31 |         44        0.63       77.62
 2015-01-01 |         16        0.23       77.85
 2015-01-02 |         20        0.28       78.13
 2015-01-03 |         14        0.20       78.33
 2015-01-04 |         45        0.64       78.97
 2015-01-05 |         32        0.45       79.42
 2015-01-06 |         14        0.20       79.62
 2015-01-07 |         25        0.36       79.98
 2015-01-08 |         15        0.21       80.19
 2015-01-09 |          4        0.06       80.25
 2015-01-10 |         10        0.14       80.39
 2015-01-11 |         38        0.54       80.93
 2015-01-12 |         53        0.75       81.68
 2015-01-13 |         35        0.50       82.18
 2015-01-14 |         30        0.43       82.61
 2015-01-15 |         14        0.20       82.81
 2015-01-16 |         15        0.21       83.02
 2015-01-17 |          3        0.04       83.06
 2015-01-18 |         16        0.23       83.29
 2015-01-19 |         24        0.34       83.63
 2015-01-20 |         14        0.20       83.83
 2015-01-21 |         21        0.30       84.13
 2015-01-22 |          9        0.13       84.25
 2015-01-23 |          8        0.11       84.37
 2015-01-24 |          7        0.10       84.47
 2015-01-25 |         13        0.18       84.65
 2015-01-26 |         21        0.30       84.95
 2015-01-27 |         11        0.16       85.11
 2015-01-28 |         20        0.28       85.39
 2015-01-29 |         37        0.53       85.92
 2015-01-30 |         44        0.63       86.54
 2015-01-31 |         24        0.34       86.88
 2015-02-01 |         25        0.36       87.24
 2015-02-02 |         40        0.57       87.81
 2015-02-03 |         16        0.23       88.03
 2015-02-04 |         28        0.40       88.43
 2015-02-05 |         18        0.26       88.69
 2015-02-06 |         21        0.30       88.99
 2015-02-07 |          8        0.11       89.10
 2015-02-08 |         10        0.14       89.24
 2015-02-09 |         14        0.20       89.44
 2015-02-10 |         22        0.31       89.75
 2015-02-11 |         20        0.28       90.04
 2015-02-12 |         25        0.36       90.39
 2015-02-13 |          5        0.07       90.46
 2015-02-14 |          9        0.13       90.59
 2015-02-15 |          6        0.09       90.68
 2015-02-16 |          8        0.11       90.79
 2015-02-17 |          6        0.09       90.88
 2015-02-20 |          3        0.04       90.92
 2015-02-21 |          2        0.03       90.95
 2015-02-22 |         10        0.14       91.09
 2015-02-23 |          4        0.06       91.15
 2015-02-24 |          4        0.06       91.20
 2015-02-25 |          7        0.10       91.30
 2015-02-26 |         11        0.16       91.46
 2015-02-27 |          8        0.11       91.57
 2015-02-28 |         15        0.21       91.79
 2015-03-01 |         10        0.14       91.93
 2015-03-02 |         14        0.20       92.13
 2015-03-03 |          3        0.04       92.17
 2015-03-04 |          3        0.04       92.21
 2015-03-05 |          7        0.10       92.31
 2015-03-06 |         13        0.18       92.50
 2015-03-07 |         11        0.16       92.65
 2015-03-08 |         14        0.20       92.85
 2015-03-09 |         26        0.37       93.22
 2015-03-10 |         16        0.23       93.45
 2015-03-11 |         11        0.16       93.61
 2015-03-12 |         11        0.16       93.76
 2015-03-13 |          1        0.01       93.78
 2015-03-14 |         10        0.14       93.92
 2015-03-15 |          9        0.13       94.05
 2015-03-16 |          5        0.07       94.12
 2015-03-18 |          7        0.10       94.22
 2015-03-19 |          4        0.06       94.27
 2015-03-20 |         18        0.26       94.53
 2015-03-21 |          5        0.07       94.60
 2015-03-22 |         21        0.30       94.90
 2015-03-23 |         11        0.16       95.05
 2015-03-24 |         13        0.18       95.24
 2015-03-25 |         34        0.48       95.72
 2015-03-26 |         40        0.57       96.29
 2015-03-27 |         21        0.30       96.59
 2015-03-29 |         33        0.47       97.06
 2015-03-30 |        106        1.51       98.56
 2015-03-31 |         29        0.41       98.98
 2015-04-01 |         72        1.02      100.00
------------+-----------------------------------
      Total |      7,037      100.00

. gen int_y = substr(P05D_DAY, 1,4)

. gen int_m = substr(P05D_DAY, 6,2)

. gen int_d = substr(P05D_DAY, 9,2)

. destring int_y, replace
int_y: all characters numeric; replaced as int

. destring int_m, replace
int_m: all characters numeric; replaced as byte

. destring int_d, replace
int_d: all characters numeric; replaced as byte

. 
. tab int_y

      int_y |      Freq.     Percent        Cum.
------------+-----------------------------------
       2014 |      5,462       77.62       77.62
       2015 |      1,575       22.38      100.00
------------+-----------------------------------
      Total |      7,037      100.00

. tab int_m

      int_m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        652        9.27        9.27
          2 |        345        4.90       14.17
          3 |        506        7.19       21.36
          4 |         72        1.02       22.38
          6 |          5        0.07       22.45
          7 |        447        6.35       28.80
          8 |        357        5.07       33.88
          9 |        540        7.67       41.55
         10 |      1,767       25.11       66.66
         11 |      1,044       14.84       81.50
         12 |      1,302       18.50      100.00
------------+-----------------------------------
      Total |      7,037      100.00

. tab int_d

      int_d |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        270        3.84        3.84
          2 |        231        3.28        7.12
          3 |        195        2.77        9.89
          4 |        242        3.44       13.33
          5 |        232        3.30       16.63
          6 |        184        2.61       19.24
          7 |        223        3.17       22.41
          8 |        196        2.79       25.20
          9 |        209        2.97       28.17
         10 |        206        2.93       31.09
         11 |        264        3.75       34.84
         12 |        279        3.96       38.81
         13 |        207        2.94       41.75
         14 |        244        3.47       45.22
         15 |        188        2.67       47.89
         16 |        203        2.88       50.77
         17 |        190        2.70       53.47
         18 |        192        2.73       56.20
         19 |        200        2.84       59.05
         20 |        227        3.23       62.27
         21 |        208        2.96       65.23
         22 |        213        3.03       68.25
         23 |        215        3.06       71.31
         24 |        217        3.08       74.39
         25 |        228        3.24       77.63
         26 |        294        4.18       81.81
         27 |        263        3.74       85.55
         28 |        275        3.91       89.46
         29 |        237        3.37       92.82
         30 |        330        4.69       97.51
         31 |        175        2.49      100.00
------------+-----------------------------------
      Total |      7,037      100.00

. 
. gen days =.
(7,037 missing values generated)

. replace days =  0 if int_m == 6 & int_y == 2014
(5 real changes made)

. replace days =  int_d if int_m == 7 & int_y == 2014
(447 real changes made)

. replace days =  int_d + 31 if int_m == 8 & int_y == 2014
(357 real changes made)

. replace days =  int_d + 62 if int_m == 9 & int_y == 2014
(540 real changes made)

. replace days =  int_d + 92 if int_m == 10 & int_y == 2014
(1,767 real changes made)

. replace days =  int_d + 123 if int_m == 11 & int_y == 2014
(1,044 real changes made)

. replace days =  int_d + 153 if int_m == 12 & int_y == 2014
(1,302 real changes made)

. replace days =  int_d + 184 if int_m == 1 & int_y == 2015
(652 real changes made)

. replace days =  int_d + 215 if int_m == 2 & int_y == 2015
(345 real changes made)

. replace days =  int_d + 244 if int_m == 3 & int_y == 2015
(506 real changes made)

. replace days =  int_d + 275 if int_m == 4 & int_y == 2015
(72 real changes made)

. tab days,m

       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5        0.07        0.07
          1 |          4        0.06        0.13
          2 |          2        0.03        0.16
          3 |          7        0.10        0.26
          4 |         12        0.17        0.43
          5 |         10        0.14        0.57
          6 |         10        0.14        0.71
          7 |         12        0.17        0.88
          8 |         13        0.18        1.07
          9 |          6        0.09        1.15
         10 |         18        0.26        1.41
         11 |         22        0.31        1.72
         12 |         23        0.33        2.05
         13 |         11        0.16        2.20
         14 |         16        0.23        2.43
         15 |         24        0.34        2.77
         16 |         33        0.47        3.24
         17 |         44        0.63        3.87
         18 |         15        0.21        4.08
         19 |         13        0.18        4.26
         20 |         16        0.23        4.49
         21 |         11        0.16        4.65
         22 |         15        0.21        4.86
         23 |         13        0.18        5.04
         24 |          3        0.04        5.09
         25 |          5        0.07        5.16
         26 |         24        0.34        5.50
         27 |         24        0.34        5.84
         28 |         18        0.26        6.10
         29 |          3        0.04        6.14
         30 |         10        0.14        6.28
         31 |         10        0.14        6.42
         32 |         10        0.14        6.57
         33 |          5        0.07        6.64
         34 |          9        0.13        6.76
         35 |          6        0.09        6.85
         36 |          9        0.13        6.98
         37 |          8        0.11        7.09
         38 |         10        0.14        7.23
         39 |         20        0.28        7.52
         40 |         15        0.21        7.73
         41 |          4        0.06        7.79
         42 |         10        0.14        7.93
         43 |          2        0.03        7.96
         44 |         13        0.18        8.14
         45 |         18        0.26        8.40
         46 |          6        0.09        8.48
         47 |          6        0.09        8.57
         49 |          3        0.04        8.61
         50 |          9        0.13        8.74
         51 |         22        0.31        9.05
         52 |          9        0.13        9.18
         53 |          3        0.04        9.22
         54 |          6        0.09        9.31
         55 |         30        0.43        9.73
         56 |         10        0.14        9.88
         57 |         18        0.26       10.13
         58 |         14        0.20       10.33
         59 |         25        0.36       10.69
         60 |         16        0.23       10.91
         61 |         13        0.18       11.10
         62 |         28        0.40       11.50
         63 |         25        0.36       11.85
         64 |          8        0.11       11.97
         65 |         12        0.17       12.14
         66 |         17        0.24       12.38
         67 |         12        0.17       12.55
         68 |          5        0.07       12.62
         69 |          1        0.01       12.63
         70 |          2        0.03       12.66
         71 |          4        0.06       12.72
         72 |          1        0.01       12.73
         73 |         23        0.33       13.06
         74 |         11        0.16       13.22
         75 |          8        0.11       13.33
         76 |         32        0.45       13.78
         77 |          8        0.11       13.90
         78 |          6        0.09       13.98
         79 |          2        0.03       14.01
         80 |         12        0.17       14.18
         81 |         14        0.20       14.38
         82 |         15        0.21       14.59
         83 |         17        0.24       14.84
         84 |         17        0.24       15.08
         85 |         17        0.24       15.32
         86 |         29        0.41       15.73
         87 |         22        0.31       16.04
         88 |         46        0.65       16.70
         89 |         54        0.77       17.46
         90 |         65        0.92       18.39
         91 |         35        0.50       18.89
         92 |         20        0.28       19.17
         93 |         45        0.64       19.81
         94 |         71        1.01       20.82
         95 |         61        0.87       21.69
         96 |         78        1.11       22.79
         97 |         79        1.12       23.92
         98 |         54        0.77       24.68
         99 |         56        0.80       25.48
        100 |         45        0.64       26.12
        101 |         47        0.67       26.79
        102 |         69        0.98       27.77
        103 |         79        1.12       28.89
        104 |         99        1.41       30.30
        105 |         60        0.85       31.15
        106 |         50        0.71       31.86
        107 |         32        0.45       32.31
        108 |         39        0.55       32.87
        109 |         54        0.77       33.64
        110 |         67        0.95       34.59
        111 |         76        1.08       35.67
        112 |         63        0.90       36.56
        113 |         31        0.44       37.00
        114 |         45        0.64       37.64
        115 |         41        0.58       38.23
        116 |         54        0.77       38.99
        117 |         75        1.07       40.06
        118 |         86        1.22       41.28
        119 |         52        0.74       42.02
        120 |         41        0.58       42.60
        121 |         30        0.43       43.03
        122 |         48        0.68       43.71
        123 |         40        0.57       44.28
        124 |         21        0.30       44.58
        125 |         52        0.74       45.32
        126 |         41        0.58       45.90
        127 |         21        0.30       46.20
        128 |         35        0.50       46.70
        129 |         15        0.21       46.91
        130 |         31        0.44       47.35
        131 |         41        0.58       47.93
        132 |         71        1.01       48.94
        133 |         45        0.64       49.58
        134 |         17        0.24       49.82
        135 |         17        0.24       50.06
        136 |         20        0.28       50.35
        137 |         17        0.24       50.59
        138 |         55        0.78       51.37
        139 |         62        0.88       52.25
        140 |         51        0.72       52.98
        141 |         31        0.44       53.42
        142 |         28        0.40       53.82
        143 |         42        0.60       54.41
        144 |         33        0.47       54.88
        145 |         29        0.41       55.29
        146 |         33        0.47       55.76
        147 |         31        0.44       56.20
        148 |         25        0.36       56.56
        149 |         25        0.36       56.91
        150 |         36        0.51       57.43
        151 |         20        0.28       57.71
        152 |         45        0.64       58.35
        153 |         54        0.77       59.12
        154 |         42        0.60       59.71
        155 |         19        0.27       59.98
        156 |         32        0.45       60.44
        157 |         32        0.45       60.89
        158 |         30        0.43       61.32
        159 |         44        0.63       61.94
        160 |         69        0.98       62.92
        161 |         36        0.51       63.44
        162 |         22        0.31       63.75
        163 |         21        0.30       64.05
        164 |         44        0.63       64.67
        165 |         38        0.54       65.21
        166 |         54        0.77       65.98
        167 |         62        0.88       66.86
        168 |         34        0.48       67.34
        169 |         29        0.41       67.76
        170 |         30        0.43       68.18
        171 |         41        0.58       68.77
        172 |         32        0.45       69.22
        173 |         34        0.48       69.70
        174 |         79        1.12       70.83
        175 |         64        0.91       71.74
        176 |         82        1.17       72.90
        177 |         46        0.65       73.55
        178 |         37        0.53       74.08
        179 |         23        0.33       74.41
        180 |         43        0.61       75.02
        181 |         71        1.01       76.03
        182 |         38        0.54       76.57
        183 |         30        0.43       76.99
        184 |         44        0.63       77.62
        185 |         16        0.23       77.85
        186 |         20        0.28       78.13
        187 |         14        0.20       78.33
        188 |         45        0.64       78.97
        189 |         32        0.45       79.42
        190 |         14        0.20       79.62
        191 |         25        0.36       79.98
        192 |         15        0.21       80.19
        193 |          4        0.06       80.25
        194 |         10        0.14       80.39
        195 |         38        0.54       80.93
        196 |         53        0.75       81.68
        197 |         35        0.50       82.18
        198 |         30        0.43       82.61
        199 |         14        0.20       82.81
        200 |         15        0.21       83.02
        201 |          3        0.04       83.06
        202 |         16        0.23       83.29
        203 |         24        0.34       83.63
        204 |         14        0.20       83.83
        205 |         21        0.30       84.13
        206 |          9        0.13       84.25
        207 |          8        0.11       84.37
        208 |          7        0.10       84.47
        209 |         13        0.18       84.65
        210 |         21        0.30       84.95
        211 |         11        0.16       85.11
        212 |         20        0.28       85.39
        213 |         37        0.53       85.92
        214 |         44        0.63       86.54
        215 |         24        0.34       86.88
        216 |         25        0.36       87.24
        217 |         40        0.57       87.81
        218 |         16        0.23       88.03
        219 |         28        0.40       88.43
        220 |         18        0.26       88.69
        221 |         21        0.30       88.99
        222 |          8        0.11       89.10
        223 |         10        0.14       89.24
        224 |         14        0.20       89.44
        225 |         22        0.31       89.75
        226 |         20        0.28       90.04
        227 |         25        0.36       90.39
        228 |          5        0.07       90.46
        229 |          9        0.13       90.59
        230 |          6        0.09       90.68
        231 |          8        0.11       90.79
        232 |          6        0.09       90.88
        235 |          3        0.04       90.92
        236 |          2        0.03       90.95
        237 |         10        0.14       91.09
        238 |          4        0.06       91.15
        239 |          4        0.06       91.20
        240 |          7        0.10       91.30
        241 |         11        0.16       91.46
        242 |          8        0.11       91.57
        243 |         15        0.21       91.79
        245 |         10        0.14       91.93
        246 |         14        0.20       92.13
        247 |          3        0.04       92.17
        248 |          3        0.04       92.21
        249 |          7        0.10       92.31
        250 |         13        0.18       92.50
        251 |         11        0.16       92.65
        252 |         14        0.20       92.85
        253 |         26        0.37       93.22
        254 |         16        0.23       93.45
        255 |         11        0.16       93.61
        256 |         11        0.16       93.76
        257 |          1        0.01       93.78
        258 |         10        0.14       93.92
        259 |          9        0.13       94.05
        260 |          5        0.07       94.12
        262 |          7        0.10       94.22
        263 |          4        0.06       94.27
        264 |         18        0.26       94.53
        265 |          5        0.07       94.60
        266 |         21        0.30       94.90
        267 |         11        0.16       95.05
        268 |         13        0.18       95.24
        269 |         34        0.48       95.72
        270 |         40        0.57       96.29
        271 |         21        0.30       96.59
        273 |         33        0.47       97.06
        274 |        106        1.51       98.56
        275 |         29        0.41       98.98
        276 |         72        1.02      100.00
------------+-----------------------------------
      Total |      7,037      100.00

. 
. *** treatment indicator
. tab days if int_m == 2 & int_d ==26  & int_y == 2015 // treatment date: days == 241

       days |      Freq.     Percent        Cum.
------------+-----------------------------------
        241 |         11      100.00      100.00
------------+-----------------------------------
      Total |         11      100.00

. gen treat = (days >= 241) 

. tab treat, m

      treat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,425       91.30       91.30
          1 |        612        8.70      100.00
------------+-----------------------------------
      Total |      7,037      100.00

. 
. 
. ********************************************************************************
. *** Append the previous waves
. ********************************************************************************
. 
. append using `w1'

. append using `w2'

. append using `w3'

. append using `w4'

. 
. ********************************************************************************
. *** Outcast the variable values
. *******************************************************************************
. 
. *** Indicators
. bys opid: egen tind = total(treat) // treatment indicator

. bys opid: gen waves =_N // total completed waves

. bys opid: egen w1_part = total(w1==1)

. bys opid: egen w2_part = total(w2==1)

. bys opid: egen w3_part = total(w3==1)

. bys opid: egen w4_part = total(w4==1)

. bys opid: egen w5_part = total(w5==1)

. tab waves

      waves |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,223        3.01        3.01
          2 |      1,736        4.28        7.29
          3 |      2,568        6.33       13.61
          4 |      4,312       10.62       24.23
          5 |     30,760       75.77      100.00
------------+-----------------------------------
      Total |     40,599      100.00

. bys W: tab waves

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> W = 1

      waves |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,137       11.37       11.37
          2 |        837        8.37       19.75
          3 |        793        7.93       27.68
          4 |      1,078       10.78       38.46
          5 |      6,152       61.54      100.00
------------+-----------------------------------
      Total |      9,997      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> W = 2

      waves |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        655        7.83        7.83
          3 |        654        7.82       15.65
          4 |        903       10.80       26.45
          5 |      6,152       73.55      100.00
------------+-----------------------------------
      Total |      8,364      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> W = 3

      waves |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         17        0.22        0.22
          2 |        130        1.65        1.86
          3 |        683        8.66       10.53
          4 |        902       11.44       21.97
          5 |      6,152       78.03      100.00
------------+-----------------------------------
      Total |      7,884      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> W = 4

      waves |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          3        0.04        0.04
          2 |         56        0.77        0.81
          3 |        225        3.08        3.88
          4 |        881       12.04       15.92
          5 |      6,152       84.08      100.00
------------+-----------------------------------
      Total |      7,317      100.00

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> W = 5

      waves |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         66        0.94        0.94
          2 |         58        0.82        1.76
          3 |        213        3.03        4.79
          4 |        548        7.79       12.58
          5 |      6,152       87.42      100.00
------------+-----------------------------------
      Total |      7,037      100.00


. 
. gen post = (W == 5) // post treatment period

. recode treat .=0, gen(w)
(33,562 differences between treat and w)

. tab w

  RECODE of |
      treat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     39,987       98.49       98.49
          1 |        612        1.51      100.00
------------+-----------------------------------
      Total |     40,599      100.00

. tab W, gen(f) // dummy for each period

          W |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      9,997       24.62       24.62
          2 |      8,364       20.60       45.23
          3 |      7,884       19.42       64.64
          4 |      7,317       18.02       82.67
          5 |      7,037       17.33      100.00
------------+-----------------------------------
      Total |     40,599      100.00

. 
. bys opid: egen days_all = total(days)

. // bys opid: egen mar = total(marital)
. // tab mar if W == 1
. // recode mar 0=0 1/5=1
. bys opid: egen weight = mean(P05wei_L)
(6,832 missing values generated)

. // bys opid: egen educ_total = mean(educ)
. bys opid: egen d = total(treat) // eventually treated

. 
. 
. *** Stableized Weights
. egen wt_sum = sum(P05wei_L)

. gen wt_rs = weight / wt_sum
(6,832 missing values generated)

. 
. bys opid: egen num_y = count(y) // number of waves with valid y

. 
. *** Reverse code the outcome variables
. replace y = 5 - y if !missing(y)
(40,576 real changes made)

. replace y1  = 5- y1 if !missing(y1)
(9,979 real changes made)

. replace y2  = 5- y2 if !missing(y2)
(8,363 real changes made)

. replace y3  = 5- y3 if !missing(y3)
(7,882 real changes made)

. replace y4  = 5- y4 if !missing(y4)
(7,316 real changes made)

. replace y5  = 5- y5 if !missing(y5)
(7,036 real changes made)

. 
. *** Covariates
. /* Note: All covariates drawn from wave 4, except place of residence at 15  */
. 
. foreach var in age_4 educ_4 marital_4 employed_4 relig_4 health_4 reg15_1  {
  2.         bys opid: egen `var'_r = mean(`var')
  3. }
(5,531 missing values generated)
(5,530 missing values generated)
(5,525 missing values generated)
(5,525 missing values generated)
(5,530 missing values generated)
(5,525 missing values generated)
(337 missing values generated)

. 
. gen covar_miss = ///
>         missing(age_4_r, educ_4_r, marital_4_r,employed_4_r, relig_4_r, ///
>                                 health_4_r,  reg15_1_r )

. 
. *** misc variables needed for auxiliary analysis
. foreach var in marital_1 marital_2 marital_3   {
  2.         bys opid: egen `var'_r = mean(`var')
  3. }
(337 missing values generated)
(2,955 missing values generated)
(3,905 missing values generated)

. 
. *** misc variables needed for auxiliary analysis
. foreach var in marital_d_1 marital_d_2 marital_d_3 marital_d_4   {
  2.         bys opid: egen `var'_r = mean(`var')
  3. }
(343 missing values generated)
(2,955 missing values generated)
(3,905 missing values generated)
(5,525 missing values generated)

. 
. 
. foreach var in y1 y2 y3 y4 y5   {
  2.         bys opid: egen `var'_r = mean(`var')
  3. }
(394 missing values generated)
(2,959 missing values generated)
(3,915 missing values generated)
(5,530 missing values generated)
(6,830 missing values generated)

. 
. ********************************************************************************
. *** Variable and value labels
. ********************************************************************************
. 
. la def AGE 0 "Below 40" 40 "40-49" 50 "50 and Above" 

. la def EMPLOYED 1 "Employed" 0 "Unemployed/NIL"

. la def MARITAL 0  "Never Married" 1 "Ever Married" 

. la def EDUC 1 "HS or Less" 2 "AA/BA/MA/PHD" 

. la def  REG15  1 "Metropolitan/Abroad" 2 "Mid-sized" 3 "Rural"

. la def  RELIG 0 "None/Other" 1 "Protestant" 2 "Catholic" 3 "Buddhist"

. la def YESNO 0 "No" 1 "Yes"

. 
. la var age_4_r  "Age groups (w4)"

. la var educ_4_r "Eduation (w4)"

. la var marital_4_r "Marital status (w4)"

. la var relig_4_r "Religion (w4)"

. la var employed_4_r "Employement status (w4)"

. la var health_4_r "Self-rated Health (w4)"

. la var reg15_1 "Metro status at 15 (w4)"

. 
. la val age_4_r AGE

. la val educ_4_r EDUC

. la val marital_4_r MARITAL

. la val relig_4_r RELIG

. la val employed_4_r EMPLOYED

. la val reg15_1 REG15

. 
. ********************************************************************************
. *** Save the data
. ********************************************************************************
. save data/data_w1_w5_recoded.dta, replace
(file data/data_w1_w5_recoded.dta not found)
file data/data_w1_w5_recoded.dta saved

. 
. log close
      name:  <unnamed>
       log:  C:\wd\adultery-law-south-korea-demres\log/01_data-prep.log
  log type:  text
 closed on:  27 Nov 2024, 18:43:21
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
