---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\wd\adultery-law-south-korea-demres\log/03-web-search-trends.log
  log type:  text
 opened on:  27 Nov 2024, 18:43:59

. 
. ********************************************************************************
. *** Visualize the Google Search Trends
. ********************************************************************************
. 
. import delimited using data/adultery_abolision.csv, clear
(encoding automatically selected: UTF-8)
(2 vars, 104 obs)

. 
. fre v1, all

v1
----------------------------------------------------------------
                   |      Freq.    Percent      Valid       Cum.
-------------------+--------------------------------------------
Valid   2014-01-05 |          1       0.96       0.96       0.96
        2014-01-12 |          1       0.96       0.96       1.92
        2014-01-19 |          1       0.96       0.96       2.88
        2014-01-26 |          1       0.96       0.96       3.85
        2014-02-02 |          1       0.96       0.96       4.81
        2014-02-09 |          1       0.96       0.96       5.77
        2014-02-16 |          1       0.96       0.96       6.73
        2014-02-23 |          1       0.96       0.96       7.69
        2014-03-02 |          1       0.96       0.96       8.65
        2014-03-09 |          1       0.96       0.96       9.62
        2014-03-16 |          1       0.96       0.96      10.58
        2014-03-23 |          1       0.96       0.96      11.54
        2014-03-30 |          1       0.96       0.96      12.50
        2014-04-06 |          1       0.96       0.96      13.46
        2014-04-13 |          1       0.96       0.96      14.42
        2014-04-20 |          1       0.96       0.96      15.38
        2014-04-27 |          1       0.96       0.96      16.35
        2014-05-04 |          1       0.96       0.96      17.31
        2014-05-11 |          1       0.96       0.96      18.27
        2014-05-18 |          1       0.96       0.96      19.23
        2014-05-25 |          1       0.96       0.96      20.19
        2014-06-01 |          1       0.96       0.96      21.15
        2014-06-08 |          1       0.96       0.96      22.12
        2014-06-15 |          1       0.96       0.96      23.08
        2014-06-22 |          1       0.96       0.96      24.04
        2014-06-29 |          1       0.96       0.96      25.00
        2014-07-06 |          1       0.96       0.96      25.96
        2014-07-13 |          1       0.96       0.96      26.92
        2014-07-20 |          1       0.96       0.96      27.88
        2014-07-27 |          1       0.96       0.96      28.85
        2014-08-03 |          1       0.96       0.96      29.81
        2014-08-10 |          1       0.96       0.96      30.77
        2014-08-17 |          1       0.96       0.96      31.73
        2014-08-24 |          1       0.96       0.96      32.69
        2014-08-31 |          1       0.96       0.96      33.65
        2014-09-07 |          1       0.96       0.96      34.62
        2014-09-14 |          1       0.96       0.96      35.58
        2014-09-21 |          1       0.96       0.96      36.54
        2014-09-28 |          1       0.96       0.96      37.50
        2014-10-05 |          1       0.96       0.96      38.46
        2014-10-12 |          1       0.96       0.96      39.42
        2014-10-19 |          1       0.96       0.96      40.38
        2014-10-26 |          1       0.96       0.96      41.35
        2014-11-02 |          1       0.96       0.96      42.31
        2014-11-09 |          1       0.96       0.96      43.27
        2014-11-16 |          1       0.96       0.96      44.23
        2014-11-23 |          1       0.96       0.96      45.19
        2014-11-30 |          1       0.96       0.96      46.15
        2014-12-07 |          1       0.96       0.96      47.12
        2014-12-14 |          1       0.96       0.96      48.08
        2014-12-21 |          1       0.96       0.96      49.04
        2014-12-28 |          1       0.96       0.96      50.00
        2015-01-04 |          1       0.96       0.96      50.96
        2015-01-11 |          1       0.96       0.96      51.92
        2015-01-18 |          1       0.96       0.96      52.88
        2015-01-25 |          1       0.96       0.96      53.85
        2015-02-01 |          1       0.96       0.96      54.81
        2015-02-08 |          1       0.96       0.96      55.77
        2015-02-15 |          1       0.96       0.96      56.73
        2015-02-22 |          1       0.96       0.96      57.69
        2015-03-01 |          1       0.96       0.96      58.65
        2015-03-08 |          1       0.96       0.96      59.62
        2015-03-15 |          1       0.96       0.96      60.58
        2015-03-22 |          1       0.96       0.96      61.54
        2015-03-29 |          1       0.96       0.96      62.50
        2015-04-05 |          1       0.96       0.96      63.46
        2015-04-12 |          1       0.96       0.96      64.42
        2015-04-19 |          1       0.96       0.96      65.38
        2015-04-26 |          1       0.96       0.96      66.35
        2015-05-03 |          1       0.96       0.96      67.31
        2015-05-10 |          1       0.96       0.96      68.27
        2015-05-17 |          1       0.96       0.96      69.23
        2015-05-24 |          1       0.96       0.96      70.19
        2015-05-31 |          1       0.96       0.96      71.15
        2015-06-07 |          1       0.96       0.96      72.12
        2015-06-14 |          1       0.96       0.96      73.08
        2015-06-21 |          1       0.96       0.96      74.04
        2015-06-28 |          1       0.96       0.96      75.00
        2015-07-05 |          1       0.96       0.96      75.96
        2015-07-12 |          1       0.96       0.96      76.92
        2015-07-19 |          1       0.96       0.96      77.88
        2015-07-26 |          1       0.96       0.96      78.85
        2015-08-02 |          1       0.96       0.96      79.81
        2015-08-09 |          1       0.96       0.96      80.77
        2015-08-16 |          1       0.96       0.96      81.73
        2015-08-23 |          1       0.96       0.96      82.69
        2015-08-30 |          1       0.96       0.96      83.65
        2015-09-06 |          1       0.96       0.96      84.62
        2015-09-13 |          1       0.96       0.96      85.58
        2015-09-20 |          1       0.96       0.96      86.54
        2015-09-27 |          1       0.96       0.96      87.50
        2015-10-04 |          1       0.96       0.96      88.46
        2015-10-11 |          1       0.96       0.96      89.42
        2015-10-18 |          1       0.96       0.96      90.38
        2015-10-25 |          1       0.96       0.96      91.35
        2015-11-01 |          1       0.96       0.96      92.31
        2015-11-08 |          1       0.96       0.96      93.27
        2015-11-15 |          1       0.96       0.96      94.23
        2015-11-22 |          1       0.96       0.96      95.19
        2015-11-29 |          1       0.96       0.96      96.15
        2015-12-06 |          1       0.96       0.96      97.12
        2015-12-13 |          1       0.96       0.96      98.08
        2015-12-20 |          1       0.96       0.96      99.04
        2015-12-27 |          1       0.96       0.96     100.00
        Total      |        104     100.00     100.00           
----------------------------------------------------------------

. fre v2, all

v2
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         90      86.54      86.54      86.54
        31    |          1       0.96       0.96      87.50
        33    |          3       2.88       2.88      90.38
        34    |          2       1.92       1.92      92.31
        35    |          2       1.92       1.92      94.23
        36    |          1       0.96       0.96      95.19
        65    |          1       0.96       0.96      96.15
        68    |          1       0.96       0.96      97.12
        69    |          1       0.96       0.96      98.08
        74    |          1       0.96       0.96      99.04
        100   |          1       0.96       0.96     100.00
        Total |        104     100.00     100.00           
-----------------------------------------------------------

. 
. gen type = "Abolision of adultery law"

. gen y = substr(v1, 1,4)

. gen m = substr(v1, 6,2)

. gen d = substr(v1, 9,2)

. destring y, replace
y: all characters numeric; replaced as int

. destring m, replace
m: all characters numeric; replaced as byte

. destring d, replace
d: all characters numeric; replaced as byte

. 
. tab y, m

          y |      Freq.     Percent        Cum.
------------+-----------------------------------
       2014 |         52       50.00       50.00
       2015 |         52       50.00      100.00
------------+-----------------------------------
      Total |        104      100.00

. tab m, m

          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        7.69        7.69
          2 |          8        7.69       15.38
          3 |         10        9.62       25.00
          4 |          8        7.69       32.69
          5 |          9        8.65       41.35
          6 |          9        8.65       50.00
          7 |          8        7.69       57.69
          8 |         10        9.62       67.31
          9 |          8        7.69       75.00
         10 |          8        7.69       82.69
         11 |         10        9.62       92.31
         12 |          8        7.69      100.00
------------+-----------------------------------
      Total |        104      100.00

. tab d, m

          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        3.85        3.85
          2 |          4        3.85        7.69
          3 |          2        1.92        9.62
          4 |          3        2.88       12.50
          5 |          4        3.85       16.35
          6 |          4        3.85       20.19
          7 |          3        2.88       23.08
          8 |          4        3.85       26.92
          9 |          4        3.85       30.77
         10 |          2        1.92       32.69
         11 |          3        2.88       35.58
         12 |          4        3.85       39.42
         13 |          4        3.85       43.27
         14 |          3        2.88       46.15
         15 |          4        3.85       50.00
         16 |          4        3.85       53.85
         17 |          2        1.92       55.77
         18 |          3        2.88       58.65
         19 |          4        3.85       62.50
         20 |          4        3.85       66.35
         21 |          3        2.88       69.23
         22 |          4        3.85       73.08
         23 |          4        3.85       76.92
         24 |          2        1.92       78.85
         25 |          3        2.88       81.73
         26 |          4        3.85       85.58
         27 |          4        3.85       89.42
         28 |          3        2.88       92.31
         29 |          3        2.88       95.19
         30 |          3        2.88       98.08
         31 |          2        1.92      100.00
------------+-----------------------------------
      Total |        104      100.00

. 
. gen date = mdy(m,d,y) 

. format date %d

. 
. replace v2 = v2 + 0.2 if v2 == 0
variable v2 was byte now float
(90 real changes made)

. 
. tempfile data1

. save `data1', replace
(file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000001.tmp not found)
file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000001.tmp saved as .dta format

. 
. twoway bar v2 date

. 
. import delimited using data/adultery_crime.csv, clear
(encoding automatically selected: UTF-8)
(2 vars, 104 obs)

. fre v1, all

v1
----------------------------------------------------------------
                   |      Freq.    Percent      Valid       Cum.
-------------------+--------------------------------------------
Valid   2014-01-05 |          1       0.96       0.96       0.96
        2014-01-12 |          1       0.96       0.96       1.92
        2014-01-19 |          1       0.96       0.96       2.88
        2014-01-26 |          1       0.96       0.96       3.85
        2014-02-02 |          1       0.96       0.96       4.81
        2014-02-09 |          1       0.96       0.96       5.77
        2014-02-16 |          1       0.96       0.96       6.73
        2014-02-23 |          1       0.96       0.96       7.69
        2014-03-02 |          1       0.96       0.96       8.65
        2014-03-09 |          1       0.96       0.96       9.62
        2014-03-16 |          1       0.96       0.96      10.58
        2014-03-23 |          1       0.96       0.96      11.54
        2014-03-30 |          1       0.96       0.96      12.50
        2014-04-06 |          1       0.96       0.96      13.46
        2014-04-13 |          1       0.96       0.96      14.42
        2014-04-20 |          1       0.96       0.96      15.38
        2014-04-27 |          1       0.96       0.96      16.35
        2014-05-04 |          1       0.96       0.96      17.31
        2014-05-11 |          1       0.96       0.96      18.27
        2014-05-18 |          1       0.96       0.96      19.23
        2014-05-25 |          1       0.96       0.96      20.19
        2014-06-01 |          1       0.96       0.96      21.15
        2014-06-08 |          1       0.96       0.96      22.12
        2014-06-15 |          1       0.96       0.96      23.08
        2014-06-22 |          1       0.96       0.96      24.04
        2014-06-29 |          1       0.96       0.96      25.00
        2014-07-06 |          1       0.96       0.96      25.96
        2014-07-13 |          1       0.96       0.96      26.92
        2014-07-20 |          1       0.96       0.96      27.88
        2014-07-27 |          1       0.96       0.96      28.85
        2014-08-03 |          1       0.96       0.96      29.81
        2014-08-10 |          1       0.96       0.96      30.77
        2014-08-17 |          1       0.96       0.96      31.73
        2014-08-24 |          1       0.96       0.96      32.69
        2014-08-31 |          1       0.96       0.96      33.65
        2014-09-07 |          1       0.96       0.96      34.62
        2014-09-14 |          1       0.96       0.96      35.58
        2014-09-21 |          1       0.96       0.96      36.54
        2014-09-28 |          1       0.96       0.96      37.50
        2014-10-05 |          1       0.96       0.96      38.46
        2014-10-12 |          1       0.96       0.96      39.42
        2014-10-19 |          1       0.96       0.96      40.38
        2014-10-26 |          1       0.96       0.96      41.35
        2014-11-02 |          1       0.96       0.96      42.31
        2014-11-09 |          1       0.96       0.96      43.27
        2014-11-16 |          1       0.96       0.96      44.23
        2014-11-23 |          1       0.96       0.96      45.19
        2014-11-30 |          1       0.96       0.96      46.15
        2014-12-07 |          1       0.96       0.96      47.12
        2014-12-14 |          1       0.96       0.96      48.08
        2014-12-21 |          1       0.96       0.96      49.04
        2014-12-28 |          1       0.96       0.96      50.00
        2015-01-04 |          1       0.96       0.96      50.96
        2015-01-11 |          1       0.96       0.96      51.92
        2015-01-18 |          1       0.96       0.96      52.88
        2015-01-25 |          1       0.96       0.96      53.85
        2015-02-01 |          1       0.96       0.96      54.81
        2015-02-08 |          1       0.96       0.96      55.77
        2015-02-15 |          1       0.96       0.96      56.73
        2015-02-22 |          1       0.96       0.96      57.69
        2015-03-01 |          1       0.96       0.96      58.65
        2015-03-08 |          1       0.96       0.96      59.62
        2015-03-15 |          1       0.96       0.96      60.58
        2015-03-22 |          1       0.96       0.96      61.54
        2015-03-29 |          1       0.96       0.96      62.50
        2015-04-05 |          1       0.96       0.96      63.46
        2015-04-12 |          1       0.96       0.96      64.42
        2015-04-19 |          1       0.96       0.96      65.38
        2015-04-26 |          1       0.96       0.96      66.35
        2015-05-03 |          1       0.96       0.96      67.31
        2015-05-10 |          1       0.96       0.96      68.27
        2015-05-17 |          1       0.96       0.96      69.23
        2015-05-24 |          1       0.96       0.96      70.19
        2015-05-31 |          1       0.96       0.96      71.15
        2015-06-07 |          1       0.96       0.96      72.12
        2015-06-14 |          1       0.96       0.96      73.08
        2015-06-21 |          1       0.96       0.96      74.04
        2015-06-28 |          1       0.96       0.96      75.00
        2015-07-05 |          1       0.96       0.96      75.96
        2015-07-12 |          1       0.96       0.96      76.92
        2015-07-19 |          1       0.96       0.96      77.88
        2015-07-26 |          1       0.96       0.96      78.85
        2015-08-02 |          1       0.96       0.96      79.81
        2015-08-09 |          1       0.96       0.96      80.77
        2015-08-16 |          1       0.96       0.96      81.73
        2015-08-23 |          1       0.96       0.96      82.69
        2015-08-30 |          1       0.96       0.96      83.65
        2015-09-06 |          1       0.96       0.96      84.62
        2015-09-13 |          1       0.96       0.96      85.58
        2015-09-20 |          1       0.96       0.96      86.54
        2015-09-27 |          1       0.96       0.96      87.50
        2015-10-04 |          1       0.96       0.96      88.46
        2015-10-11 |          1       0.96       0.96      89.42
        2015-10-18 |          1       0.96       0.96      90.38
        2015-10-25 |          1       0.96       0.96      91.35
        2015-11-01 |          1       0.96       0.96      92.31
        2015-11-08 |          1       0.96       0.96      93.27
        2015-11-15 |          1       0.96       0.96      94.23
        2015-11-22 |          1       0.96       0.96      95.19
        2015-11-29 |          1       0.96       0.96      96.15
        2015-12-06 |          1       0.96       0.96      97.12
        2015-12-13 |          1       0.96       0.96      98.08
        2015-12-20 |          1       0.96       0.96      99.04
        2015-12-27 |          1       0.96       0.96     100.00
        Total      |        104     100.00     100.00           
----------------------------------------------------------------

. fre v2, all

v2
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |          8       7.69       7.69       7.69
        1     |         24      23.08      23.08      30.77
        2     |         34      32.69      32.69      63.46
        3     |         18      17.31      17.31      80.77
        4     |          7       6.73       6.73      87.50
        5     |          6       5.77       5.77      93.27
        6     |          3       2.88       2.88      96.15
        7     |          1       0.96       0.96      97.12
        8     |          1       0.96       0.96      98.08
        17    |          1       0.96       0.96      99.04
        100   |          1       0.96       0.96     100.00
        Total |        104     100.00     100.00           
-----------------------------------------------------------

. 
. gen type = "Adultery"

. gen y = substr(v1, 1,4)

. gen m = substr(v1, 6,2)

. gen d = substr(v1, 9,2)

. destring y, replace
y: all characters numeric; replaced as int

. destring m, replace
m: all characters numeric; replaced as byte

. destring d, replace
d: all characters numeric; replaced as byte

. 
. tab y, m

          y |      Freq.     Percent        Cum.
------------+-----------------------------------
       2014 |         52       50.00       50.00
       2015 |         52       50.00      100.00
------------+-----------------------------------
      Total |        104      100.00

. tab m, m

          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        7.69        7.69
          2 |          8        7.69       15.38
          3 |         10        9.62       25.00
          4 |          8        7.69       32.69
          5 |          9        8.65       41.35
          6 |          9        8.65       50.00
          7 |          8        7.69       57.69
          8 |         10        9.62       67.31
          9 |          8        7.69       75.00
         10 |          8        7.69       82.69
         11 |         10        9.62       92.31
         12 |          8        7.69      100.00
------------+-----------------------------------
      Total |        104      100.00

. tab d, m

          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        3.85        3.85
          2 |          4        3.85        7.69
          3 |          2        1.92        9.62
          4 |          3        2.88       12.50
          5 |          4        3.85       16.35
          6 |          4        3.85       20.19
          7 |          3        2.88       23.08
          8 |          4        3.85       26.92
          9 |          4        3.85       30.77
         10 |          2        1.92       32.69
         11 |          3        2.88       35.58
         12 |          4        3.85       39.42
         13 |          4        3.85       43.27
         14 |          3        2.88       46.15
         15 |          4        3.85       50.00
         16 |          4        3.85       53.85
         17 |          2        1.92       55.77
         18 |          3        2.88       58.65
         19 |          4        3.85       62.50
         20 |          4        3.85       66.35
         21 |          3        2.88       69.23
         22 |          4        3.85       73.08
         23 |          4        3.85       76.92
         24 |          2        1.92       78.85
         25 |          3        2.88       81.73
         26 |          4        3.85       85.58
         27 |          4        3.85       89.42
         28 |          3        2.88       92.31
         29 |          3        2.88       95.19
         30 |          3        2.88       98.08
         31 |          2        1.92      100.00
------------+-----------------------------------
      Total |        104      100.00

. 
. gen date = mdy(m,d,y) 

. format date %d

. 
. replace v2 = v2 + 0.2 if v2 == 0
variable v2 was byte now float
(8 real changes made)

. 
. tempfile data2

. save `data2', replace
(file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000002.tmp not found)
file C:\Users\jlee\AppData\Local\Temp\ST_2da7c_000002.tmp saved as .dta format

. 
. import delimited using data/adultery_law.csv, clear
(encoding automatically selected: UTF-8)
(2 vars, 104 obs)

. fre v1, all

v1
----------------------------------------------------------------
                   |      Freq.    Percent      Valid       Cum.
-------------------+--------------------------------------------
Valid   2014-01-05 |          1       0.96       0.96       0.96
        2014-01-12 |          1       0.96       0.96       1.92
        2014-01-19 |          1       0.96       0.96       2.88
        2014-01-26 |          1       0.96       0.96       3.85
        2014-02-02 |          1       0.96       0.96       4.81
        2014-02-09 |          1       0.96       0.96       5.77
        2014-02-16 |          1       0.96       0.96       6.73
        2014-02-23 |          1       0.96       0.96       7.69
        2014-03-02 |          1       0.96       0.96       8.65
        2014-03-09 |          1       0.96       0.96       9.62
        2014-03-16 |          1       0.96       0.96      10.58
        2014-03-23 |          1       0.96       0.96      11.54
        2014-03-30 |          1       0.96       0.96      12.50
        2014-04-06 |          1       0.96       0.96      13.46
        2014-04-13 |          1       0.96       0.96      14.42
        2014-04-20 |          1       0.96       0.96      15.38
        2014-04-27 |          1       0.96       0.96      16.35
        2014-05-04 |          1       0.96       0.96      17.31
        2014-05-11 |          1       0.96       0.96      18.27
        2014-05-18 |          1       0.96       0.96      19.23
        2014-05-25 |          1       0.96       0.96      20.19
        2014-06-01 |          1       0.96       0.96      21.15
        2014-06-08 |          1       0.96       0.96      22.12
        2014-06-15 |          1       0.96       0.96      23.08
        2014-06-22 |          1       0.96       0.96      24.04
        2014-06-29 |          1       0.96       0.96      25.00
        2014-07-06 |          1       0.96       0.96      25.96
        2014-07-13 |          1       0.96       0.96      26.92
        2014-07-20 |          1       0.96       0.96      27.88
        2014-07-27 |          1       0.96       0.96      28.85
        2014-08-03 |          1       0.96       0.96      29.81
        2014-08-10 |          1       0.96       0.96      30.77
        2014-08-17 |          1       0.96       0.96      31.73
        2014-08-24 |          1       0.96       0.96      32.69
        2014-08-31 |          1       0.96       0.96      33.65
        2014-09-07 |          1       0.96       0.96      34.62
        2014-09-14 |          1       0.96       0.96      35.58
        2014-09-21 |          1       0.96       0.96      36.54
        2014-09-28 |          1       0.96       0.96      37.50
        2014-10-05 |          1       0.96       0.96      38.46
        2014-10-12 |          1       0.96       0.96      39.42
        2014-10-19 |          1       0.96       0.96      40.38
        2014-10-26 |          1       0.96       0.96      41.35
        2014-11-02 |          1       0.96       0.96      42.31
        2014-11-09 |          1       0.96       0.96      43.27
        2014-11-16 |          1       0.96       0.96      44.23
        2014-11-23 |          1       0.96       0.96      45.19
        2014-11-30 |          1       0.96       0.96      46.15
        2014-12-07 |          1       0.96       0.96      47.12
        2014-12-14 |          1       0.96       0.96      48.08
        2014-12-21 |          1       0.96       0.96      49.04
        2014-12-28 |          1       0.96       0.96      50.00
        2015-01-04 |          1       0.96       0.96      50.96
        2015-01-11 |          1       0.96       0.96      51.92
        2015-01-18 |          1       0.96       0.96      52.88
        2015-01-25 |          1       0.96       0.96      53.85
        2015-02-01 |          1       0.96       0.96      54.81
        2015-02-08 |          1       0.96       0.96      55.77
        2015-02-15 |          1       0.96       0.96      56.73
        2015-02-22 |          1       0.96       0.96      57.69
        2015-03-01 |          1       0.96       0.96      58.65
        2015-03-08 |          1       0.96       0.96      59.62
        2015-03-15 |          1       0.96       0.96      60.58
        2015-03-22 |          1       0.96       0.96      61.54
        2015-03-29 |          1       0.96       0.96      62.50
        2015-04-05 |          1       0.96       0.96      63.46
        2015-04-12 |          1       0.96       0.96      64.42
        2015-04-19 |          1       0.96       0.96      65.38
        2015-04-26 |          1       0.96       0.96      66.35
        2015-05-03 |          1       0.96       0.96      67.31
        2015-05-10 |          1       0.96       0.96      68.27
        2015-05-17 |          1       0.96       0.96      69.23
        2015-05-24 |          1       0.96       0.96      70.19
        2015-05-31 |          1       0.96       0.96      71.15
        2015-06-07 |          1       0.96       0.96      72.12
        2015-06-14 |          1       0.96       0.96      73.08
        2015-06-21 |          1       0.96       0.96      74.04
        2015-06-28 |          1       0.96       0.96      75.00
        2015-07-05 |          1       0.96       0.96      75.96
        2015-07-12 |          1       0.96       0.96      76.92
        2015-07-19 |          1       0.96       0.96      77.88
        2015-07-26 |          1       0.96       0.96      78.85
        2015-08-02 |          1       0.96       0.96      79.81
        2015-08-09 |          1       0.96       0.96      80.77
        2015-08-16 |          1       0.96       0.96      81.73
        2015-08-23 |          1       0.96       0.96      82.69
        2015-08-30 |          1       0.96       0.96      83.65
        2015-09-06 |          1       0.96       0.96      84.62
        2015-09-13 |          1       0.96       0.96      85.58
        2015-09-20 |          1       0.96       0.96      86.54
        2015-09-27 |          1       0.96       0.96      87.50
        2015-10-04 |          1       0.96       0.96      88.46
        2015-10-11 |          1       0.96       0.96      89.42
        2015-10-18 |          1       0.96       0.96      90.38
        2015-10-25 |          1       0.96       0.96      91.35
        2015-11-01 |          1       0.96       0.96      92.31
        2015-11-08 |          1       0.96       0.96      93.27
        2015-11-15 |          1       0.96       0.96      94.23
        2015-11-22 |          1       0.96       0.96      95.19
        2015-11-29 |          1       0.96       0.96      96.15
        2015-12-06 |          1       0.96       0.96      97.12
        2015-12-13 |          1       0.96       0.96      98.08
        2015-12-20 |          1       0.96       0.96      99.04
        2015-12-27 |          1       0.96       0.96     100.00
        Total      |        104     100.00     100.00           
----------------------------------------------------------------

. fre v2, all

v2
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   0     |         64      61.54      61.54      61.54
        5     |          5       4.81       4.81      66.35
        6     |         16      15.38      15.38      81.73
        7     |          2       1.92       1.92      83.65
        10    |          1       0.96       0.96      84.62
        11    |          5       4.81       4.81      89.42
        12    |          3       2.88       2.88      92.31
        17    |          3       2.88       2.88      95.19
        18    |          1       0.96       0.96      96.15
        19    |          1       0.96       0.96      97.12
        24    |          1       0.96       0.96      98.08
        29    |          1       0.96       0.96      99.04
        100   |          1       0.96       0.96     100.00
        Total |        104     100.00     100.00           
-----------------------------------------------------------

. 
. gen type = "Adultery law"

. gen y = substr(v1, 1,4)

. gen m = substr(v1, 6,2)

. gen d = substr(v1, 9,2)

. destring y, replace
y: all characters numeric; replaced as int

. destring m, replace
m: all characters numeric; replaced as byte

. destring d, replace
d: all characters numeric; replaced as byte

. 
. tab y, m

          y |      Freq.     Percent        Cum.
------------+-----------------------------------
       2014 |         52       50.00       50.00
       2015 |         52       50.00      100.00
------------+-----------------------------------
      Total |        104      100.00

. tab m, m

          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        7.69        7.69
          2 |          8        7.69       15.38
          3 |         10        9.62       25.00
          4 |          8        7.69       32.69
          5 |          9        8.65       41.35
          6 |          9        8.65       50.00
          7 |          8        7.69       57.69
          8 |         10        9.62       67.31
          9 |          8        7.69       75.00
         10 |          8        7.69       82.69
         11 |         10        9.62       92.31
         12 |          8        7.69      100.00
------------+-----------------------------------
      Total |        104      100.00

. tab d, m

          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        3.85        3.85
          2 |          4        3.85        7.69
          3 |          2        1.92        9.62
          4 |          3        2.88       12.50
          5 |          4        3.85       16.35
          6 |          4        3.85       20.19
          7 |          3        2.88       23.08
          8 |          4        3.85       26.92
          9 |          4        3.85       30.77
         10 |          2        1.92       32.69
         11 |          3        2.88       35.58
         12 |          4        3.85       39.42
         13 |          4        3.85       43.27
         14 |          3        2.88       46.15
         15 |          4        3.85       50.00
         16 |          4        3.85       53.85
         17 |          2        1.92       55.77
         18 |          3        2.88       58.65
         19 |          4        3.85       62.50
         20 |          4        3.85       66.35
         21 |          3        2.88       69.23
         22 |          4        3.85       73.08
         23 |          4        3.85       76.92
         24 |          2        1.92       78.85
         25 |          3        2.88       81.73
         26 |          4        3.85       85.58
         27 |          4        3.85       89.42
         28 |          3        2.88       92.31
         29 |          3        2.88       95.19
         30 |          3        2.88       98.08
         31 |          2        1.92      100.00
------------+-----------------------------------
      Total |        104      100.00

. 
. gen date = mdy(m,d,y) 

. format date %d

. 
. replace v2 = v2 + 0.2 if v2 == 0
variable v2 was byte now float
(64 real changes made)

. 
. append using `data1'
(variable type was str12, now str25 to accommodate using data's values)

. append using `data2'

. 
. set scheme white_ptol

. 
. twoway (line v2 date if type == "Abolision of adultery law") || ///
>  (line  v2 date if type == "Adultery law", lcolor(midgreen)) || ///
>  (line  v2 date if type == "Adultery", lcolor(dkorange)) || ///
>  (pcarrowi 100 20220 100 20145 (3) "Court Decision Announced", msize(2) barbsize(2)  color(black) mlabsize(small), legend(off) ), legend(ring(0) position(11) ///
>  order(1 "Abolision of adultery law" ///
>                     2 "Adultery law" ///
>                     3 "Adultery"))  graphregion(margin(large)) ///
>  ytitle("Web Search Frequency") 

.   
. //  tline(30Jun2014 29sep2014, lcolor(black%70) lwidth(medium) lpattern(solid) ) 
. 
. 
.  gr save output/web-search-trends.gph, replace
(file output/web-search-trends.gph not found)
file output/web-search-trends.gph saved

. graph export output/web-search-trends.png,   replace 
(file output/web-search-trends.png not found)
file output/web-search-trends.png saved as PNG format

. graph export output/web-search-trends.pdf,   replace 
file output/web-search-trends.pdf saved as PDF format

. 
. log close
      name:  <unnamed>
       log:  C:\wd\adultery-law-south-korea-demres\log/03-web-search-trends.log
  log type:  text
 closed on:  27 Nov 2024, 18:44:04
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
