-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\adultery_law_korea\log/04-analysis.log
  log type:  text
 opened on:  27 Nov 2024, 15:51:14

. 
. use data/data_w1_w5_recoded.dta, clear

. 
. *** select the analytical sample
. keep if w4_part ==1 & w5_part == 1 & w3_part == 1 & w2_part ==1 & w1_par== 1
(9,839 observations deleted)

. // count if W == 1
. keep if num_y == 5 // drop Rs with missing outcome in any wave
(50 observations deleted)

. // count if W == 1
. drop if covar_miss == 1 // drop Rs with missing covariates
(10 observations deleted)

. // count if W == 1
. // count
. // tab d if W ==1
. 
end of do-file

. bys W: fre y

-----------------------------------------------------------------------------------------------------
-> W = 1

y -- RECODE of P527FV14
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   1     |        771      12.56      12.56      12.56
        2     |       2675      43.57      43.57      56.12
        3     |       1869      30.44      30.44      86.56
        4     |        825      13.44      13.44     100.00
        Total |       6140     100.00     100.00           
-----------------------------------------------------------

-----------------------------------------------------------------------------------------------------
-> W = 2

y -- RECODE of P527FV14
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   1     |        696      11.34      11.34      11.34
        2     |       3019      49.17      49.17      60.50
        3     |       1905      31.03      31.03      91.53
        4     |        520       8.47       8.47     100.00
        Total |       6140     100.00     100.00           
-----------------------------------------------------------

-----------------------------------------------------------------------------------------------------
-> W = 3

y -- RECODE of P527FV14
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   1     |        911      14.84      14.84      14.84
        2     |       2819      45.91      45.91      60.75
        3     |       1966      32.02      32.02      92.77
        4     |        444       7.23       7.23     100.00
        Total |       6140     100.00     100.00           
-----------------------------------------------------------

-----------------------------------------------------------------------------------------------------
-> W = 4

y -- RECODE of P527FV14
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   1     |        896      14.59      14.59      14.59
        2     |       2803      45.65      45.65      60.24
        3     |       1915      31.19      31.19      91.43
        4     |        526       8.57       8.57     100.00
        Total |       6140     100.00     100.00           
-----------------------------------------------------------

-----------------------------------------------------------------------------------------------------
-> W = 5

y -- RECODE of P527FV14
-----------------------------------------------------------
              |      Freq.    Percent      Valid       Cum.
--------------+--------------------------------------------
Valid   1     |        712      11.60      11.60      11.60
        2     |       2944      47.95      47.95      59.54
        3     |       2069      33.70      33.70      93.24
        4     |        415       6.76       6.76     100.00
        Total |       6140     100.00     100.00           
-----------------------------------------------------------

. bys W: sum wt_rs

-------------------------------------------------------------------
-> W = 1

    Variable |        Obs        Mean    Std. dev.       Min       
>  Max
-------------+-----------------------------------------------------
> ----
       wt_rs |      6,140     .000137    .0002572   .0000132    .00
> 7469

-------------------------------------------------------------------
-> W = 2

    Variable |        Obs        Mean    Std. dev.       Min       
>  Max
-------------+-----------------------------------------------------
> ----
       wt_rs |      6,140     .000137    .0002572   .0000132    .00
> 7469

-------------------------------------------------------------------
-> W = 3

    Variable |        Obs        Mean    Std. dev.       Min       
>  Max
-------------+-----------------------------------------------------
> ----
       wt_rs |      6,140     .000137    .0002572   .0000132    .00
> 7469

-------------------------------------------------------------------
-> W = 4

    Variable |        Obs        Mean    Std. dev.       Min       
>  Max
-------------+-----------------------------------------------------
> ----
       wt_rs |      6,140     .000137    .0002572   .0000132    .00
> 7469

-------------------------------------------------------------------
-> W = 5

    Variable |        Obs        Mean    Std. dev.       Min       
>  Max
-------------+-----------------------------------------------------
> ----
       wt_rs |      6,140     .000137    .0002572   .0000132    .00
> 7469


. bys W: sum wt_rs

--------------------------------------------------------------------------------------------------------------------
-> W = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       wt_rs |      6,140     .000137    .0002572   .0000132    .007469

--------------------------------------------------------------------------------------------------------------------
-> W = 2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       wt_rs |      6,140     .000137    .0002572   .0000132    .007469

--------------------------------------------------------------------------------------------------------------------
-> W = 3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       wt_rs |      6,140     .000137    .0002572   .0000132    .007469

--------------------------------------------------------------------------------------------------------------------
-> W = 4

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       wt_rs |      6,140     .000137    .0002572   .0000132    .007469

--------------------------------------------------------------------------------------------------------------------
-> W = 5

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       wt_rs |      6,140     .000137    .0002572   .0000132    .007469


. keep opid W wt_rs

. save temporing.dta
file temporing.dta saved

. exit, clear
